* TODO What You Will Need
** http://teropa.info/blog/2015/09/10/full-stack-redux-tutorial.html
** Install following packages 
*** TODO Node
*** ES6
*** React
*** Webpack
*** and Babel
** TODO For good introduction we need to take a look at [[http://survivejs.com/][SurviveJS]]
* The App 
** We'll be developing an application for organizing live votes for parties, conferences, meetings, and other gatherings of people.
** For example, here's how a vote on the best Danny Boyle film
could go:

The app puts entries against each other in pairs, until a winner is found. 

** The app will have two separate user interfaces: The voting UI
can be used on a mobile device, or anything else that has a
web browser. The results UI is designed to be beamed on a
projector or some other large screen. It'll show the results
of the running vote in real time.

* The Architecture 
** The system will technically consist of two applications:
There's a browser app we'll make with React that provides
both the user interfaces, and a server app we'll make for
Node that handles the voting logic. Communication between the
two will be done using WebSockets.
** We're going to use Redux to organize the application code
both on the client and on the server. For holding the state
we'll use Immutable data structures.

** Even though there'll be a lot of similarity between the
client and server - both will use Redux, for example - this
isn't really a universal/isomorphic application and the two
won't actually share any code. 

* The Server Application 
** Description
***  We're going to write the Node application first and the React application after that. This will let us concentrate on the core logic before we start thinking about the UI.
*** As we create the server app, we'll get acquainted with Redux and Immutable, and will see how an application built with them holds together. Redux is most often associated with React applications, but it really isn't limited to that use case. Part of what we're going to learn is how useful Redux can be in other contexts as well!
** Designing The Application State Tree 
*** Designing a Redux app often begins by thinking about the application state data structure. This is what describes what's going on in your application at any given time.
*** All kinds of frameworks and architectures have state. 
**** In Ember apps and Backbone apps, state is in Models. 
**** In Angular apps, state is often in Factories and Services. 
**** In most Flux implementations, it is in Stores. 
**** How does Redux differ from these
***** The main difference is that in Redux.
***** the application state is all stored in one single tree structure. In other words, everything there is to know
about your application's state is stored in one data structure formed out
of maps and arrays.

** Project Setup
*** This results in a directory with the single file "package.json" in it.
#+BEGIN_SRC sh
npm init -y
#+END_SRC

#+RESULTS:
*** Install ES6, Mocha, Cha 
#+BEGIN_SRC sh
npm install --save-dev babel-core babel-cli babel-preset-es2015
npm install --save-dev mocha chai
#+END_SRC

#+RESULTS:
| babel-core@6.1.20          | node_modules/babel-core                                     |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | slash@1.0.0                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | shebang-regex@1.0.0                                         |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-exists@1.0.0                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-is-absolute@1.0.0                                      |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-messages@6.1.18                                       |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-template@6.1.18                                       |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | private@0.1.6                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-helpers@6.1.20                                        |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | esutils@2.0.2                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | convert-source-map@1.1.2                                    |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | home-or-tmp@1.0.0                                           | (os-tmpdir@1.0.1,                            | user-home@1.1.1)                              |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | source-map@0.5.3                                            |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | debug@2.2.0                                                 | (ms@0.7.1)                                   |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babylon@6.1.20                                              |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-types@6.1.18                                          | (to-fast-properties@1.0.1)                   |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | minimatch@2.0.10                                            | (brace-expansion@1.1.1)                      |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-code-frame@6.1.18                                     | (js-tokens@1.0.2,                            | line-numbers@0.2.0,                           | chalk@1.1.1,                        | repeating@1.1.3)                   |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-generator@6.1.20                                      | (trim-right@1.0.1,                           | repeating@1.1.3,                              | is-integer@1.0.6,                   | detect-indent@3.0.1)               |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-traverse@6.1.20                                       | (globals@8.12.0,                             | repeating@1.1.3,                              | invariant@2.1.2)                    |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | source-map-support@0.2.10                                   | (source-map@0.1.32)                          |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | json5@0.4.0                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | regenerator@0.8.35                                          | (through@2.3.8,                              | esprima-fb@15001.1.0-dev-harmony-fb,          | recast@0.10.24,                     | commoner@0.10.4,                   | defs@1.1.1)            |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | lodash@3.10.1                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-register@6.1.18                                       | (core-js@1.2.6)                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | babel-runtime@5.8.34                                        | (core-js@1.2.6)                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| babel-cli@6.1.18           | node_modules/babel-cli                                      |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | slash@1.0.0                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-exists@1.0.0                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | fs-readdir-recursive@0.1.2                                  |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-is-absolute@1.0.0                                      |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | log-symbols@1.0.2                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | convert-source-map@1.1.2                                    |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | v8flags@2.0.10                                              | (user-home@1.1.1)                            |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | commander@2.9.0                                             | (graceful-readlink@1.0.1)                    |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | source-map@0.5.3                                            |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | chalk@1.1.1                                                 | (escape-string-regexp@1.0.3,                 | supports-color@2.0.0,                         | ansi-styles@2.1.0,                  | has-ansi@2.0.0,                    | strip-ansi@3.0.0)      |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | glob@5.0.15                                                 | (inherits@2.0.1,                             | once@1.3.2,                                   | inflight@1.0.4,                     | minimatch@3.0.0)                   |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | output-file-sync@1.1.1                                      | (xtend@4.0.1,                                | mkdirp@0.5.1)                                 |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | request@2.65.0                                              | (aws-sign2@0.6.0,                            | forever-agent@0.6.1,                          | tunnel-agent@0.4.1,                 | oauth-sign@0.8.0,                  | caseless@0.11.0,       | stringstream@0.0.5,             | isstream@0.1.2,        | json-stringify-safe@5.0.1, | extend@3.0.0,         | tough-cookie@2.2.1, | qs@5.2.0, | node-uuid@1.4.6, | combined-stream@1.0.5, | mime-types@2.1.7, | form-data@1.0.0-rc3, | http-signature@0.11.0, | hawk@3.1.1, | bl@1.0.0, | har-validator@2.0.2) |
| ├──                        | chokidar@1.2.0                                              | (arrify@1.0.0,                               | glob-parent@2.0.0,                            | async-each@0.1.6,                   | is-glob@2.0.1,                     | is-binary-path@1.0.1,  | lodash.flatten@3.0.2,           | readdirp@2.0.0,        | anymatch@1.3.0)            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | bin-version-check@2.1.0                                     | (semver-truncate@1.0.0,                      | minimist@1.2.0,                               | semver@4.3.6,                       | bin-version@1.0.4)                 |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | lodash@3.10.1                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-register@6.1.18                                       | (home-or-tmp@1.0.0,                          | source-map-support@0.2.10,                    | core-js@1.2.6)                      |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-polyfill@6.1.19                                       | (regenerator@0.8.42,                         | core-js@1.2.6)                                |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | babel-runtime@5.8.34                                        | (core-js@1.2.6)                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| babel-preset-es2015@6.1.18 | node_modules/babel-preset-es2015                            |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-shorthand-properties@6.1.18   | (babel-types@6.1.18,                         | babel-runtime@5.8.34)                         |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-arrow-functions@6.1.18        | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-template-literals@6.1.18      | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-literals@6.1.18               | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-block-scoped-functions@6.1.18 | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-typeof-symbol@6.1.18          | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-spread@6.1.18                 | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-destructuring@6.1.18          | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-check-es2015-constants@6.1.18                  | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-for-of@6.1.18                 | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-block-scoping@6.1.18          | (babel-types@6.1.18,                         | babel-template@6.1.18,                        | babel-traverse@6.1.20,              | lodash@3.10.1,                     | babel-runtime@5.8.34)  |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-function-name@6.1.18          | (babel-types@6.1.18,                         | babel-helper-function-name@6.1.18,            | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-object-super@6.1.18           | (babel-helper-replace-supers@6.1.18,         | babel-runtime@5.8.34)                         |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-computed-properties@6.1.18    | (babel-template@6.1.18,                      | babel-helper-define-map@6.1.18,               | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-sticky-regex@6.1.18           | (babel-helper-regex@6.1.18,                  | babel-types@6.1.18,                           | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-unicode-regex@6.1.18          | (regexpu@1.3.0,                              | babel-helper-regex@6.1.18,                    | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-parameters@6.1.18             | (babel-helper-get-function-arity@6.1.18,     | babel-helper-call-delegate@6.1.18,            | babel-template@6.1.18,              | babel-types@6.1.18,                | babel-traverse@6.1.20, | babel-runtime@5.8.34)           |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-modules-commonjs@6.1.20       | (babel-plugin-transform-strict-mode@6.1.18,  | babel-template@6.1.18,                        | babel-types@6.1.18,                 | babel-runtime@5.8.34)              |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-classes@6.1.20                | (babel-messages@6.1.18,                      | babel-helper-optimise-call-expression@6.1.18, | babel-helper-replace-supers@6.1.18, | babel-helper-function-name@6.1.18, | babel-template@6.1.18, | babel-helper-define-map@6.1.18, | babel-types@6.1.18,    | babel-traverse@6.1.20,     | babel-runtime@5.8.34) |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | babel-plugin-transform-regenerator@6.1.18                   | (babel-plugin-syntax-async-functions@6.1.18, | private@0.1.6,                                | through@2.3.8,                      | babylon@6.1.20,                    | commoner@0.10.4,       | babel-types@6.1.18,             | babel-traverse@6.1.20, | babel-runtime@5.8.34)      |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| chai@3.4.1                 | node_modules/chai                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | assertion-error@1.0.1                                       |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | type-detect@1.0.0                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | deep-eql@0.1.3                                              | (type-detect@0.1.1)                          |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| mocha@2.3.3                | node_modules/mocha                                          |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | escape-string-regexp@1.0.2                                  |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | commander@2.3.0                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | diff@1.4.0                                                  |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | supports-color@1.2.0                                        |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | growl@1.8.1                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | debug@2.0.0                                                 | (ms@0.6.2)                                   |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | mkdirp@0.5.0                                                | (minimist@0.0.8)                             |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | glob@3.2.3                                                  | (inherits@2.0.1,                             | graceful-fs@2.0.3,                            | minimatch@0.2.14)                   |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | jade@0.26.3                                                 | (commander@0.6.1,                            | mkdirp@0.3.0)                                 |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
*** tests with mocha command 
#+BEGIN_SRC sh
mkdir test
./node_modules/mocha/bin/mocha --compilers js:babel-core/register --recursive
#+END_SRC

#+RESULTS:

** Getting Comfortable With Immutable 
** Writing The Application Logic With Pure Functions 
*** Loading Entries 
*** Starting The Vote 
*** Voting 
*** Moving to The Next Pair 
*** Ending The Vote 

** Introducing Actions and Reducers 
** A Taste of Reducer Composition 
** Introducing The Redux Store 
** Setting Up a Socket.io Server 
** Broadcasting State from A Redux Listener 
** Receiving Remote Redux Actions 

* The Client Application 
** Client Project Setup 
*** Unit Testing support 
** React and react-hot-loader 
** Writing The UI for The Voting Screen 
** Immutable Data And Pure Rendering 
** Writing The UI for The Results Screen And Handling Routing 
** Introducing A Client-Side Redux Store 
** Getting Data In from Redux to React 
** Setting Up The Socket.io Client 
** Receiving Actions From The Server 
** Dispatching Actions From React Components 
** Sending Actions To The Server Using Redux Middleware 
* Exercises 
** 1. Invalid Vote Prevention 
** 2. Improved Vote State Reset 
** 3. Duplicate Vote Prevention 
** 4. Restarting The Vote 
** 5. Indicating Socket Connection State 
** Bonus Challenge: Going Peer to Peer 
 
